# Python/ SQL basic tutorial

## pip install psycopg2, sqlalchemy

## Types of SQL database 
- postgres- https://www.postgresql.org/ (open source)
- mysql- https://www.mysql.com/ by oracle
- Microsoft sql - https://www.microsoft.com/en-us/sql-server/default.aspx

In [1]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd

/anaconda3/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

## Setup database connection using username, password and database name

In [2]:
conn = psycopg2.connect("dbname=postgres user=jugal1 password=jugal1")
engine = create_engine('postgresql+psycopg2://jugal1:jugal1@localhost/postgres')

## Fetching NFL draft data from http://www.nfl.com/draft/history/fulldraft?season

-Using pandas read_html

## Using pandas to_sql to export data to postgres database
### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.to_sql.html

In [3]:
final_df = pd.DataFrame()
for i in range(2000, 2019):
    print(i)
    for j in range(0, 7):
        df = pd.read_html('http://www.nfl.com/draft/history/fulldraft?season=' + str(i))

        df1 = df[j].copy()

        df1.columns = df1.columns.droplevel()

        df1['year'] = i
        df1['round'] = j + 1
        final_df = final_df.append(df1)

final_df.to_sql('nfl_drafts', con=engine, if_exists='replace')

2000
2001
2002
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
2013
2014
2015
2016
2017
2018

## Fetch college team information table from http://www.nfl.com/draft/history/fulldraft?season

In [4]:
df_teams = pd.read_html('https://en.wikipedia.org/wiki/List_of_NCAA_Division_I_FBS_football_programs', header= 0)

df_teams = df_teams[0]
df_teams.to_sql('college_teams', con=engine, if_exists='replace')

## Using read sql to fetch data from postgres
### https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.read_sql.html

In [5]:
querry_1 = '''SELECT college_teams."Team", "State[1]", "PLAYER", "year", "round"
     FROM "college_teams" 
     JOIN "nfl_drafts"
     ON college_teams."Team" = nfl_drafts."SCHOOL"
;'''

drafts_by_state_df = pd.read_sql(querry_1, engine)
drafts_by_state_df.head(10)

             Team      State[1]           PLAYER  year  round
0      Penn State  Pennsylvania   Courtney Brown  2000      1
1      Penn State  Pennsylvania  LaVar Arrington  2000      1
2         Alabama       Alabama    Chris Samuels  2000      1
3   Florida State       Florida    Peter Warrick  2000      1
4       Tennessee     Tennessee      Jamal Lewis  2000      1
5   Florida State       Florida      Corey Simon  2000      1
6        Virginia      Virginia     Thomas Jones  2000      1
7  Michigan State      Michigan  Plaxico Burress  2000      1
8      New Mexico    New Mexico   Brian Urlacher  2000      1
9         Florida       Florida    Travis Taylor  2000      1

## States with the highest number of drafts

In [6]:
querry_2 = '''SELECT "State[1]", count("PLAYER") as "Number of Drafts"
     FROM "college_teams" 
     JOIN "nfl_drafts"
     ON college_teams."Team" = nfl_drafts."SCHOOL"
     GROUP BY "State[1]"
     ORDER BY  -count("PLAYER")'''

top_states_df = pd.read_sql(querry_2, engine)
top_states_df.head(10)

         State[1]  Number of Drafts
0      California               378
1         Florida               248
2           Texas               220
3         Alabama               181
4            Ohio               177
5        Michigan               166
6         Indiana               150
7         Georgia               149
8    Pennsylvania               136
9  South Carolina               132

In [7]:
querry_3 = '''SELECT "State[1]", "year", count("PLAYER") as "Number of Drafts"
     FROM "college_teams" 
     JOIN "nfl_drafts"
     ON college_teams."Team" = nfl_drafts."SCHOOL"
     GROUP BY "State[1]", "year"
     ORDER BY "State[1]", "year"
;'''

df3 = pd.read_sql(querry_3, engine)
df3.head()

  State[1]  year  Number of Drafts
0  Alabama  2000                 7
1  Alabama  2001                 6
2  Alabama  2002                 7
3  Alabama  2003                 5
4  Alabama  2004                 8

In [8]:
# libraries and data
import matplotlib.pyplot as plt
 
# Make a data frame

# Initialize the figure
plt.style.use('seaborn-darkgrid')
 
# create a color palette
palette = plt.get_cmap('copper')
 
# multiple line plot
num=0
for column in df3['State[1]'].unique():
    num+=1
 
    # Find the right spot on the plot
    plt.subplot(10,5, num)
 
    # Plot the lineplot
    plt.plot(df3[df3['State[1]']== column]['year'], df3[df3['State[1]']== column]['Number of Drafts'] , marker='', color=palette(0), linewidth=1.9, alpha=0.9, label=column)
 
    # Same limits for everybody!
    plt.xlim(2000,2018) 
    plt.ylim(0,30) 
    # Add title
    plt.title(column, loc='left', fontsize=20, fontweight=0, color=palette(num) )
    plt.xticks(df3[df3['State[1]']== column]['year'], ['2000','','','','', '2005','','','','', '2010','','','','', '2015'])

# general title

# Axis title
plt.text(0.4, 0.02, 'Time', ha='center', va='center')
plt.text(0.06, 0.5, 'Note', ha='center', va='center', rotation='vertical')
 
# Get current size
fig_size = plt.rcParams["figure.figsize"]
 
# Prints: [8.0, 6.0]
print("Current size:"), fig_size
 
# Set figure width to 12 and height to 9
fig_size[0] = 30
fig_size[1] = 30
plt.rcParams["figure.figsize"] = fig_size
plt.subplots_adjust(left=None, bottom=None, right=None, top=None, wspace=.5, hspace=.5)
plt.suptitle("Number of NFL Drafts by State", fontsize=50, fontweight=0, color='black', style='italic')
plt.savefig('/Users/jugalmarfatia/Documents/fall 2018/College Draft/College_Draft-/data/1.pdf')

Current size:

In [9]:
querry_3 = '''SELECT *
     FROM "nfl_drafts"
;'''

df4 = pd.read_sql(querry_3, engine)
df4.head()

,index,SEL #,TEAM,PLAYER,POSITION,SCHOOL,year,round
0,0,1,Cleveland Browns,Courtney Brown,DE,Penn State,2000,1
1,1,2,Washington Redskins,LaVar Arrington,OLB,Penn State,2000,1
2,2,3,Washington Redskins,Chris Samuels,T,Alabama,2000,1
3,3,4,Cincinnati Bengals,Peter Warrick,WR,Florida State,2000,1
4,4,5,Baltimore Ravens,Jamal Lewis,RB,Tennessee,2000,1

In [10]:
df4 = pd.read_csv('/Users/jugalmarfatia/Documents/fall 2018/College Draft/College_Draft-/data/college_draft.csv')
df4.head()

,Unnamed: 0,SEL #,TEAM,PLAYER,POSITION,SCHOOL,year,round
0,0,1,Cleveland Browns,Courtney Brown,DE,Penn State,2000,1
1,1,2,Washington Redskins,LaVar Arrington,OLB,Penn State,2000,1
2,2,3,Washington Redskins,Chris Samuels,T,Alabama,2000,1
3,3,4,Cincinnati Bengals,Peter Warrick,WR,Florida State,2000,1
4,4,5,Baltimore Ravens,Jamal Lewis,RB,Tennessee,2000,1